<template>
	<ExCascader label="测试" v-model="value" :options="options"></ExCascader>
</template>

<script setup>
import { ref } from "vue"
import ExCascader from "../components/form/ExCascader.jsx"

const value = ref(["190000", "199500", "199501"])
const text = ref("")
const options = ref([])

const setOptions = () => {
	options.value = [
		{
			value: "010000",
			label: "农、林、牧、渔业",
			children: [
				{
					value: "010100",
					label: "农业",
					children: [
						{
							value: "010101",
							label: "谷物种植",
						},
						{
							value: "010102",
							label: "豆类、油料和薯类种植",
						},
						/* {
							 "value": "010103",
							 "label": "棉、麻、糖、烟草种植"
						 },
						 {
							 "value": "010104",
							 "label": "蔬菜、食用菌及园艺作物种植"
						 },
						 {
							 "value": "010105",
							 "label": "水果种植"
						 },
						 {
							 "value": "010106",
							 "label": "坚果、含油果、香料和饮料作物种植"
						 },
						 {
							 "value": "010107",
							 "label": "中药材种植"
						 },
						 {
							 "value": "010109",
							 "label": "其他农业"
						 }*/
					],
				},
				{
					value: "010200",
					label: "林业",
					children: [
						{
							value: "010201",
							label: "林木育种和育苗",
						},
						{
							value: "010202",
							label: "造林和更新",
						},
						{
							value: "010203",
							label: "森林经营和管护",
						},
						{
							value: "010204",
							label: "木材和竹材采运",
						},
						{
							value: "010205",
							label: "林产品采集",
						},
					],
				},
				/*{
					value: "010300",
					label: "畜牧业",
					children: [
						{
							value: "010301",
							label: "牲畜饲养",
						},
						{
							value: "010302",
							label: "家禽饲养",
						},
						{
							value: "010303",
							label: "狩猎和捕捉动物",
						},
						{
							value: "010309",
							label: "其他畜牧业",
						},
					],
				},
				{
					value: "010400",
					label: "渔业",
					children: [
						{
							value: "010401",
							label: "水产养殖",
						},
						{
							value: "010402",
							label: "水产捕捞",
						},
					],
				},
				{
					value: "010500",
					label: "农、林、牧、渔专业及辅助性活动",
					children: [
						{
							value: "010501",
							label: "农业服务业",
						},
						{
							value: "010502",
							label: "林业服务业",
						},
						{
							value: "010503",
							label: "畜牧服务业",
						},
						{
							value: "010504",
							label: "渔业服务业",
						},
					],
				},*/
			],
		},
		{
			value: "020000",
			label: "采矿业",
			children: [
				{
					value: "020600",
					label: "煤炭开采和洗选业",
					children: [
						{
							value: "020601",
							label: "烟煤和无烟煤开采洗选",
						},
						{
							value: "020602",
							label: "褐煤开采洗选",
						},
						{
							value: "020609",
							label: "其他煤炭采选",
						},
					],
				},
				/* {
					 "value": "020700",
					 "label": "石油和天然气开采业",
					 "children": [
						 {
							 "value": "020701",
							 "label": "石油开采"
						 },
						 {
							 "value": "020702",
							 "label": "天然气开采"
						 }
					 ]
				 },
				 {
					 "value": "020800",
					 "label": "黑色金属矿采选业",
					 "children": [
						 {
							 "value": "020801",
							 "label": "铁矿采选"
						 },
						 {
							 "value": "020802",
							 "label": "锰矿、铬矿采选"
						 },
						 {
							 "value": "020809",
							 "label": "其他黑色金属矿采选"
						 }
					 ]
				 },
				 {
					 "value": "020900",
					 "label": "有色金属矿采选业",
					 "children": [
						 {
							 "value": "020901",
							 "label": "常用有色金属矿采选"
						 },
						 {
							 "value": "020902",
							 "label": "贵金属矿采选"
						 },
						 {
							 "value": "020903",
							 "label": "稀有稀土金属矿采选"
						 }
					 ]
				 },
				 {
					 "value": "021000",
					 "label": "非金属矿采选业",
					 "children": [
						 {
							 "value": "021001",
							 "label": "土砂石开采"
						 },
						 {
							 "value": "021002",
							 "label": "化学矿开采"
						 },
						 {
							 "value": "021003",
							 "label": "采盐"
						 },
						 {
							 "value": "021009",
							 "label": "石棉及其他非金属矿采选"
						 }
					 ]
				 },
				 {
					 "value": "021100",
					 "label": "开采专业及辅助性活动",
					 "children": [
						 {
							 "value": "021101",
							 "label": "煤炭开采和洗选辅助活动"
						 },
						 {
							 "value": "021102",
							 "label": "石油和天然气开采辅助活动"
						 },
						 {
							 "value": "021109",
							 "label": "其他开采辅助活动"
						 }
					 ]
				 },
				 {
					 "value": "021200",
					 "label": "其他采矿业",
					 "children": [
						 {
							 "value": "021201",
							 "label": "其他采矿业"
						 }
					 ]
				 }*/
			],
		},
		/*   {
			   "value": "030000",
			   "label": "制造业",
			   "children": [
				   {
					   "value": "031300",
					   "label": "农副食品加工业",
					   "children": [
						   {
							   "value": "031301",
							   "label": "谷物磨制"
						   },
						   {
							   "value": "031302",
							   "label": "饲料加工"
						   },
						   {
							   "value": "031303",
							   "label": "植物油加工"
						   },
						   {
							   "value": "031304",
							   "label": "制糖业"
						   },
						   {
							   "value": "031305",
							   "label": "屠宰及肉类加工"
						   },
						   {
							   "value": "031306",
							   "label": "水产品加工"
						   },
						   {
							   "value": "031307",
							   "label": "蔬菜、水果和坚果加工"
						   },
						   {
							   "value": "031309",
							   "label": "其他农副食品加工"
						   }
					   ]
				   },
				   {
					   "value": "031400",
					   "label": "食品制造业",
					   "children": [
						   {
							   "value": "031401",
							   "label": "焙烤食品制造"
						   },
						   {
							   "value": "031402",
							   "label": "糖果、巧克力及蜜饯制造"
						   },
						   {
							   "value": "031403",
							   "label": "方便食品制造"
						   },
						   {
							   "value": "031404",
							   "label": "乳制品制造"
						   },
						   {
							   "value": "031405",
							   "label": "罐头食品制造"
						   },
						   {
							   "value": "031406",
							   "label": "调味品、发酵制品制造"
						   },
						   {
							   "value": "031409",
							   "label": "其他食品制造"
						   }
					   ]
				   },
				   {
					   "value": "031500",
					   "label": "酒、饮料和精制茶制造业",
					   "children": [
						   {
							   "value": "031501",
							   "label": "酒的制造"
						   },
						   {
							   "value": "031502",
							   "label": "饮料制造"
						   },
						   {
							   "value": "031503",
							   "label": "精制茶加工"
						   }
					   ]
				   },
				   {
					   "value": "031600",
					   "label": "烟草制品业",
					   "children": [
						   {
							   "value": "031601",
							   "label": "烟叶复烤"
						   },
						   {
							   "value": "031602",
							   "label": "卷烟制造"
						   },
						   {
							   "value": "031609",
							   "label": "其他烟草制品制造"
						   }
					   ]
				   },
				   {
					   "value": "031700",
					   "label": "纺织业",
					   "children": [
						   {
							   "value": "031701",
							   "label": "棉纺织及印染精加工"
						   },
						   {
							   "value": "031702",
							   "label": "毛纺织及染整精加工"
						   },
						   {
							   "value": "031703",
							   "label": "麻纺织及染整精加工"
						   },
						   {
							   "value": "031704",
							   "label": "丝绢纺织及印染精加工"
						   },
						   {
							   "value": "031705",
							   "label": "化纤织造及印染精加工"
						   },
						   {
							   "value": "031706",
							   "label": "针织或钩针编织物及其制品制造"
						   },
						   {
							   "value": "031707",
							   "label": "家用纺织制成品制造"
						   },
						   {
							   "value": "031708",
							   "label": "非家用纺织制成品制造"
						   }
					   ]
				   },
				   {
					   "value": "031800",
					   "label": "纺织服装、服饰业",
					   "children": [
						   {
							   "value": "031801",
							   "label": "机织服装制造"
						   },
						   {
							   "value": "031802",
							   "label": "针织或钩针编织服装制造"
						   },
						   {
							   "value": "031803",
							   "label": "服饰制造"
						   }
					   ]
				   },
				   {
					   "value": "031900",
					   "label": "皮革、毛皮、羽毛及其制品和制鞋业",
					   "children": [
						   {
							   "value": "031901",
							   "label": "皮革鞣制加工"
						   },
						   {
							   "value": "031902",
							   "label": "皮革制品制造"
						   },
						   {
							   "value": "031903",
							   "label": "毛皮鞣制及制品加工"
						   },
						   {
							   "value": "031904",
							   "label": "羽毛(绒)加工及制品制造"
						   },
						   {
							   "value": "031905",
							   "label": "制鞋业"
						   }
					   ]
				   },
				   {
					   "value": "032000",
					   "label": "木材加工和木、竹、藤、棕、草制品业",
					   "children": [
						   {
							   "value": "032001",
							   "label": "木材加工"
						   },
						   {
							   "value": "032002",
							   "label": "人造板制造"
						   },
						   {
							   "value": "032003",
							   "label": "木制品制造"
						   },
						   {
							   "value": "032004",
							   "label": "竹、藤、棕、草等制品制造"
						   }
					   ]
				   },
				   {
					   "value": "032100",
					   "label": "家具制造业",
					   "children": [
						   {
							   "value": "032101",
							   "label": "木质家具制造"
						   },
						   {
							   "value": "032102",
							   "label": "竹、藤家具制造"
						   },
						   {
							   "value": "032103",
							   "label": "金属家具制造"
						   },
						   {
							   "value": "032104",
							   "label": "塑料家具制造"
						   },
						   {
							   "value": "032109",
							   "label": "其他家具制造"
						   }
					   ]
				   },
				   {
					   "value": "032200",
					   "label": "造纸和纸制品业",
					   "children": [
						   {
							   "value": "032201",
							   "label": "纸浆制造"
						   },
						   {
							   "value": "032202",
							   "label": "造纸"
						   },
						   {
							   "value": "032203",
							   "label": "纸制品制造"
						   }
					   ]
				   },
				   {
					   "value": "032300",
					   "label": "印刷和记录媒介复制业",
					   "children": [
						   {
							   "value": "032301",
							   "label": "印刷"
						   },
						   {
							   "value": "032302",
							   "label": "装订及印刷相关服务"
						   },
						   {
							   "value": "032303",
							   "label": "记录媒介复制"
						   }
					   ]
				   },
				   {
					   "value": "032400",
					   "label": "文教、工美、体育和娱乐用品制造业",
					   "children": [
						   {
							   "value": "032401",
							   "label": "文教办公用品制造"
						   },
						   {
							   "value": "032402",
							   "label": "乐器制造"
						   },
						   {
							   "value": "032403",
							   "label": "工艺美术品制造"
						   },
						   {
							   "value": "032404",
							   "label": "体育用品制造"
						   },
						   {
							   "value": "032405",
							   "label": "玩具制造"
						   },
						   {
							   "value": "032406",
							   "label": "游艺器材及娱乐用品制造"
						   }
					   ]
				   },
				   {
					   "value": "032500",
					   "label": "石油、煤炭及其他燃料加工业",
					   "children": [
						   {
							   "value": "032501",
							   "label": "精炼石油产品制造"
						   },
						   {
							   "value": "032502",
							   "label": "炼焦"
						   },
						   {
							   "value": "032503",
							   "label": "核燃料加工"
						   }
					   ]
				   },
				   {
					   "value": "032600",
					   "label": "化学原料和化学制品制造业",
					   "children": [
						   {
							   "value": "032601",
							   "label": "基础化学原料制造"
						   },
						   {
							   "value": "032602",
							   "label": "肥料制造"
						   },
						   {
							   "value": "032603",
							   "label": "农药制造"
						   },
						   {
							   "value": "032604",
							   "label": "涂料、油墨、颜料及类似产品制造"
						   },
						   {
							   "value": "032605",
							   "label": "合成材料制造"
						   },
						   {
							   "value": "032606",
							   "label": "专用化学产品制造"
						   },
						   {
							   "value": "032607",
							   "label": "炸药、火工及焰火产品制造"
						   },
						   {
							   "value": "032608",
							   "label": "日用化学产品制造"
						   }
					   ]
				   },
				   {
					   "value": "032700",
					   "label": "医药制造业",
					   "children": [
						   {
							   "value": "032701",
							   "label": "化学药品原料药制造"
						   },
						   {
							   "value": "032702",
							   "label": "化学药品制剂制造"
						   },
						   {
							   "value": "032703",
							   "label": "中药饮片加工"
						   },
						   {
							   "value": "032704",
							   "label": "中成药生产"
						   },
						   {
							   "value": "032705",
							   "label": "兽用药品制造"
						   },
						   {
							   "value": "032706",
							   "label": "生物药品制造"
						   },
						   {
							   "value": "032707",
							   "label": "卫生材料及医药用品制造"
						   }
					   ]
				   },
				   {
					   "value": "032800",
					   "label": "化学纤维制造业",
					   "children": [
						   {
							   "value": "032801",
							   "label": "纤维素纤维原料及纤维制造"
						   },
						   {
							   "value": "032802",
							   "label": "合成纤维制造"
						   }
					   ]
				   },
				   {
					   "value": "032900",
					   "label": "橡胶和塑料制品业",
					   "children": [
						   {
							   "value": "032901",
							   "label": "橡胶制品业"
						   },
						   {
							   "value": "032902",
							   "label": "塑料制品业"
						   }
					   ]
				   },
				   {
					   "value": "033000",
					   "label": "非金属矿物制品业",
					   "children": [
						   {
							   "value": "033001",
							   "label": "水泥、石灰和石膏制造"
						   },
						   {
							   "value": "033002",
							   "label": "石膏、水泥制品及类似制品制造"
						   },
						   {
							   "value": "033003",
							   "label": "砖瓦、石材等建筑材料制造"
						   },
						   {
							   "value": "033004",
							   "label": "玻璃制造"
						   },
						   {
							   "value": "033005",
							   "label": "玻璃制品制造"
						   },
						   {
							   "value": "033006",
							   "label": "玻璃纤维和玻璃纤维增强塑料制品制造"
						   },
						   {
							   "value": "033007",
							   "label": "陶瓷制品制造"
						   },
						   {
							   "value": "033008",
							   "label": "耐火材料制品制造"
						   },
						   {
							   "value": "033009",
							   "label": "石墨及其他非金属矿物制品制造"
						   }
					   ]
				   },
				   {
					   "value": "033100",
					   "label": "黑色金属冶炼和压延加工业",
					   "children": [
						   {
							   "value": "033101",
							   "label": "炼铁"
						   },
						   {
							   "value": "033102",
							   "label": "炼钢"
						   },
						   {
							   "value": "033103",
							   "label": "黑色金属铸造"
						   },
						   {
							   "value": "033104",
							   "label": "钢压延加工"
						   },
						   {
							   "value": "033105",
							   "label": "铁合金冶炼"
						   }
					   ]
				   },
				   {
					   "value": "033200",
					   "label": "有色金属冶炼和压延加工业",
					   "children": [
						   {
							   "value": "033201",
							   "label": "常用有色金属冶炼"
						   },
						   {
							   "value": "033202",
							   "label": "贵金属冶炼"
						   },
						   {
							   "value": "033203",
							   "label": "稀有稀土金属冶炼"
						   },
						   {
							   "value": "033204",
							   "label": "有色金属合金制造"
						   },
						   {
							   "value": "033205",
							   "label": "有色金属铸造"
						   },
						   {
							   "value": "033206",
							   "label": "有色金属压延加工"
						   }
					   ]
				   },
				   {
					   "value": "033300",
					   "label": "金属制品业",
					   "children": [
						   {
							   "value": "033301",
							   "label": "结构性金属制品制造"
						   },
						   {
							   "value": "033302",
							   "label": "金属工具制造"
						   },
						   {
							   "value": "033303",
							   "label": "集装箱及金属包装容器制造"
						   },
						   {
							   "value": "033304",
							   "label": "金属丝绳及其制品制造"
						   },
						   {
							   "value": "033305",
							   "label": "建筑、安全用金属制品制造"
						   },
						   {
							   "value": "033306",
							   "label": "金属表面处理及热处理加工"
						   },
						   {
							   "value": "033307",
							   "label": "搪瓷制品制造"
						   },
						   {
							   "value": "033308",
							   "label": "金属制日用品制造"
						   },
						   {
							   "value": "033309",
							   "label": "其他金属制品制造"
						   }
					   ]
				   },
				   {
					   "value": "033400",
					   "label": "通用设备制造业",
					   "children": [
						   {
							   "value": "033401",
							   "label": "锅炉及原动设备制造"
						   },
						   {
							   "value": "033402",
							   "label": "金属加工机械制造"
						   },
						   {
							   "value": "033403",
							   "label": "物料搬运设备制造"
						   },
						   {
							   "value": "033404",
							   "label": "泵、阀门、压缩机及类似机械制造"
						   },
						   {
							   "value": "033405",
							   "label": "轴承、齿轮和传动部件制造"
						   },
						   {
							   "value": "033406",
							   "label": "烘炉、风机、衡器、包装等设备制造"
						   },
						   {
							   "value": "033407",
							   "label": "文化、办公用机械制造"
						   },
						   {
							   "value": "033408",
							   "label": "通用零部件制造"
						   },
						   {
							   "value": "033409",
							   "label": "其他通用设备制造业"
						   }
					   ]
				   },
				   {
					   "value": "033500",
					   "label": "专用设备制造业",
					   "children": [
						   {
							   "value": "033501",
							   "label": "采矿、冶金、建筑专用设备制造"
						   },
						   {
							   "value": "033502",
							   "label": "化工、木材、非金属加工专用设备制造"
						   },
						   {
							   "value": "033503",
							   "label": "食品、饮料、烟草及饲料生产专用设备制造"
						   },
						   {
							   "value": "033504",
							   "label": "印刷、制药、日化及日用品生产专用设备制造"
						   },
						   {
							   "value": "033505",
							   "label": "纺织、服装和皮革加工专用设备制造"
						   },
						   {
							   "value": "033506",
							   "label": "电子和电工机械专用设备制造"
						   },
						   {
							   "value": "033507",
							   "label": "农、林、牧、渔专用机械制造"
						   },
						   {
							   "value": "033508",
							   "label": "医疗仪器设备及器械制造"
						   },
						   {
							   "value": "033509",
							   "label": "环保、社会公共服务及其他专用设备制造"
						   }
					   ]
				   },
				   {
					   "value": "033600",
					   "label": "汽车制造业",
					   "children": [
						   {
							   "value": "033601",
							   "label": "汽车整车制造"
						   },
						   {
							   "value": "033602",
							   "label": "改装汽车制造"
						   },
						   {
							   "value": "033603",
							   "label": "低速载货汽车制造"
						   },
						   {
							   "value": "033604",
							   "label": "电车制造"
						   },
						   {
							   "value": "033605",
							   "label": "汽车车身、挂车制造"
						   },
						   {
							   "value": "033606",
							   "label": "汽车零部件及配件制造"
						   }
					   ]
				   },
				   {
					   "value": "033700",
					   "label": "铁路、船舶、航空航天和其他运输设备制造业",
					   "children": [
						   {
							   "value": "033701",
							   "label": "铁路运输设备制造"
						   },
						   {
							   "value": "033702",
							   "label": "城市轨道交通设备制造"
						   },
						   {
							   "value": "033703",
							   "label": "船舶及相关装置制造"
						   },
						   {
							   "value": "033704",
							   "label": "航空、航天器及设备制造"
						   },
						   {
							   "value": "033705",
							   "label": "摩托车制造"
						   },
						   {
							   "value": "033706",
							   "label": "自行车制造"
						   },
						   {
							   "value": "033707",
							   "label": "非公路休闲车及零配件制造"
						   },
						   {
							   "value": "033709",
							   "label": "潜水救捞及其他未列明运输设备制造"
						   }
					   ]
				   },
				   {
					   "value": "033800",
					   "label": "电气机械和器材制造业",
					   "children": [
						   {
							   "value": "033801",
							   "label": "电机制造"
						   },
						   {
							   "value": "033802",
							   "label": "输配电及控制设备制造"
						   },
						   {
							   "value": "033803",
							   "label": "电线、电缆、光缆及电工器材制造"
						   },
						   {
							   "value": "033804",
							   "label": "电池制造"
						   },
						   {
							   "value": "033805",
							   "label": "家用电力器具制造"
						   },
						   {
							   "value": "033806",
							   "label": "非电力家用器具制造"
						   },
						   {
							   "value": "033807",
							   "label": "照明器具制造"
						   },
						   {
							   "value": "033809",
							   "label": "其他电气机械及器材制造"
						   }
					   ]
				   },
				   {
					   "value": "033900",
					   "label": "计算机、通信和其他电子设备制造业",
					   "children": [
						   {
							   "value": "033901",
							   "label": "计算机制造"
						   },
						   {
							   "value": "033902",
							   "label": "通信设备制造"
						   },
						   {
							   "value": "033903",
							   "label": "广播电视设备制造"
						   },
						   {
							   "value": "033904",
							   "label": "雷达及配套设备制造"
						   },
						   {
							   "value": "033905",
							   "label": "视听设备制造"
						   },
						   {
							   "value": "033906",
							   "label": "电子器件制造"
						   },
						   {
							   "value": "033907",
							   "label": "电子元件制造"
						   },
						   {
							   "value": "033909",
							   "label": "其他电子设备制造"
						   }
					   ]
				   },
				   {
					   "value": "034000",
					   "label": "仪器仪表制造业",
					   "children": [
						   {
							   "value": "034001",
							   "label": "通用仪器仪表制造"
						   },
						   {
							   "value": "034002",
							   "label": "专用仪器仪表制造"
						   },
						   {
							   "value": "034003",
							   "label": "钟表与计时仪器制造"
						   },
						   {
							   "value": "034004",
							   "label": "光学仪器及眼镜制造"
						   },
						   {
							   "value": "034009",
							   "label": "其他仪器仪表制造业"
						   }
					   ]
				   },
				   {
					   "value": "034100",
					   "label": "其他制造业",
					   "children": [
						   {
							   "value": "034101",
							   "label": "日用杂品制造"
						   },
						   {
							   "value": "034102",
							   "label": "煤制品制造"
						   },
						   {
							   "value": "034103",
							   "label": "核辐射加工"
						   },
						   {
							   "value": "034109",
							   "label": "其他未列明制造业"
						   }
					   ]
				   },
				   {
					   "value": "034200",
					   "label": "废弃资源综合利用业",
					   "children": [
						   {
							   "value": "034201",
							   "label": "金属废料和碎屑加工处理"
						   },
						   {
							   "value": "034202",
							   "label": "非金属废料和碎屑加工处理"
						   }
					   ]
				   },
				   {
					   "value": "034300",
					   "label": "金属制品、机械和设备修理业",
					   "children": [
						   {
							   "value": "034301",
							   "label": "金属制品修理"
						   },
						   {
							   "value": "034302",
							   "label": "通用设备修理"
						   },
						   {
							   "value": "034303",
							   "label": "专用设备修理"
						   },
						   {
							   "value": "034304",
							   "label": "铁路、船舶、航空航天等运输设备修理"
						   },
						   {
							   "value": "034305",
							   "label": "电气设备修理"
						   },
						   {
							   "value": "034306",
							   "label": "仪器仪表修理"
						   },
						   {
							   "value": "034309",
							   "label": "其他机械和设备修理业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "040000",
			   "label": "电力、热力、燃气及水生产和供应业",
			   "children": [
				   {
					   "value": "044400",
					   "label": "电力、热力生产和供应业",
					   "children": [
						   {
							   "value": "044401",
							   "label": "电力生产"
						   },
						   {
							   "value": "044402",
							   "label": "电力供应"
						   },
						   {
							   "value": "044403",
							   "label": "热力生产和供应"
						   }
					   ]
				   },
				   {
					   "value": "044500",
					   "label": "燃气生产和供应业",
					   "children": [
						   {
							   "value": "044501",
							   "label": "燃气生产和供应业"
						   }
					   ]
				   },
				   {
					   "value": "044600",
					   "label": "水的生产和供应业",
					   "children": [
						   {
							   "value": "044601",
							   "label": "自来水生产和供应"
						   },
						   {
							   "value": "044602",
							   "label": "污水处理及其再生利用"
						   },
						   {
							   "value": "044609",
							   "label": "其他水的处理、利用与分配"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "050000",
			   "label": "建筑业",
			   "children": [
				   {
					   "value": "054700",
					   "label": "房屋建筑业",
					   "children": [
						   {
							   "value": "054701",
							   "label": "房屋建筑业"
						   }
					   ]
				   },
				   {
					   "value": "054800",
					   "label": "土木工程建筑业",
					   "children": [
						   {
							   "value": "054801",
							   "label": "铁路、道路、隧道和桥梁工程建筑"
						   },
						   {
							   "value": "054802",
							   "label": "水利和内河港口工程建筑"
						   },
						   {
							   "value": "054803",
							   "label": "海洋工程建筑"
						   },
						   {
							   "value": "054804",
							   "label": "工矿工程建筑"
						   },
						   {
							   "value": "054805",
							   "label": "架线和管道工程建筑"
						   },
						   {
							   "value": "054809",
							   "label": "其他土木工程建筑"
						   }
					   ]
				   },
				   {
					   "value": "054900",
					   "label": "建筑安装业",
					   "children": [
						   {
							   "value": "054901",
							   "label": "电气安装"
						   },
						   {
							   "value": "054902",
							   "label": "管道和设备安装"
						   },
						   {
							   "value": "054909",
							   "label": "其他建筑安装业"
						   }
					   ]
				   },
				   {
					   "value": "055000",
					   "label": "建筑装饰、装修和其他建筑业",
					   "children": [
						   {
							   "value": "055001",
							   "label": "建筑装饰业"
						   },
						   {
							   "value": "055002",
							   "label": "工程准备活动"
						   },
						   {
							   "value": "055003",
							   "label": "提供施工设备服务"
						   },
						   {
							   "value": "055009",
							   "label": "其他未列明建筑业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "060000",
			   "label": "批发和零售业",
			   "children": [
				   {
					   "value": "065100",
					   "label": "批发业",
					   "children": [
						   {
							   "value": "065101",
							   "label": "农、林、牧产品批发"
						   },
						   {
							   "value": "065102",
							   "label": "食品、饮料及烟草制品批发"
						   },
						   {
							   "value": "065103",
							   "label": "纺织、服装及家庭用品批发"
						   },
						   {
							   "value": "065104",
							   "label": "文化、体育用品及器材批发"
						   },
						   {
							   "value": "065105",
							   "label": "医药及医疗器材批发"
						   },
						   {
							   "value": "065106",
							   "label": "矿产品、建材及化工产品批发"
						   },
						   {
							   "value": "065107",
							   "label": "机械设备、五金产品及电子产品批发"
						   },
						   {
							   "value": "065108",
							   "label": "贸易经纪与代理"
						   },
						   {
							   "value": "065109",
							   "label": "其他批发业"
						   }
					   ]
				   },
				   {
					   "value": "065200",
					   "label": "零售业",
					   "children": [
						   {
							   "value": "065201",
							   "label": "综合零售"
						   },
						   {
							   "value": "065202",
							   "label": "食品、饮料及烟草制品专门零售"
						   },
						   {
							   "value": "065203",
							   "label": "纺织、服装及日用品专门零售"
						   },
						   {
							   "value": "065204",
							   "label": "文化、体育用品及器材专门零售"
						   },
						   {
							   "value": "065205",
							   "label": "医药及医疗器材专门零售"
						   },
						   {
							   "value": "065206",
							   "label": "汽车、摩托车、燃料及零配件专门零售"
						   },
						   {
							   "value": "065207",
							   "label": "家用电器及电子产品专门零售"
						   },
						   {
							   "value": "065208",
							   "label": "五金、家具及室内装饰材料专门零售"
						   },
						   {
							   "value": "065209",
							   "label": "货摊、无店铺及其他零售业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "070000",
			   "label": "交通运输、仓储和邮政业",
			   "children": [
				   {
					   "value": "075300",
					   "label": "铁路运输业",
					   "children": [
						   {
							   "value": "075301",
							   "label": "铁路旅客运输"
						   },
						   {
							   "value": "075302",
							   "label": "铁路货物运输"
						   },
						   {
							   "value": "075303",
							   "label": "铁路运输辅助活动"
						   }
					   ]
				   },
				   {
					   "value": "075400",
					   "label": "道路运输业",
					   "children": [
						   {
							   "value": "075401",
							   "label": "城市公共交通运输"
						   },
						   {
							   "value": "075402",
							   "label": "公路旅客运输"
						   },
						   {
							   "value": "075403",
							   "label": "道路货物运输"
						   },
						   {
							   "value": "075404",
							   "label": "道路运输辅助活动"
						   }
					   ]
				   },
				   {
					   "value": "075500",
					   "label": "水上运输业",
					   "children": [
						   {
							   "value": "075501",
							   "label": "水上旅客运输"
						   },
						   {
							   "value": "075502",
							   "label": "水上货物运输"
						   },
						   {
							   "value": "075503",
							   "label": "水上运输辅助活动"
						   }
					   ]
				   },
				   {
					   "value": "075600",
					   "label": "航空运输业",
					   "children": [
						   {
							   "value": "075601",
							   "label": "航空客货运输"
						   },
						   {
							   "value": "075602",
							   "label": "通用航空服务"
						   },
						   {
							   "value": "075603",
							   "label": "航空运输辅助活动"
						   }
					   ]
				   },
				   {
					   "value": "075700",
					   "label": "管道运输业",
					   "children": [
						   {
							   "value": "075701",
							   "label": "管道运输业"
						   }
					   ]
				   },
				   {
					   "value": "075800",
					   "label": "多式联运和运输代理业",
					   "children": [
						   {
							   "value": "075801",
							   "label": "装卸搬运"
						   },
						   {
							   "value": "075802",
							   "label": "运输代理业"
						   }
					   ]
				   },
				   {
					   "value": "075900",
					   "label": "装卸搬运和仓储业",
					   "children": [
						   {
							   "value": "075901",
							   "label": "谷物、棉花等农产品仓储"
						   },
						   {
							   "value": "075909",
							   "label": "其他仓储业"
						   }
					   ]
				   },
				   {
					   "value": "076000",
					   "label": "邮政业",
					   "children": [
						   {
							   "value": "076001",
							   "label": "邮政基本服务"
						   },
						   {
							   "value": "076002",
							   "label": "快递服务"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "080000",
			   "label": "住宿和餐饮业",
			   "children": [
				   {
					   "value": "086100",
					   "label": "住宿业",
					   "children": [
						   {
							   "value": "086101",
							   "label": "旅游饭店"
						   },
						   {
							   "value": "086102",
							   "label": "一般旅馆"
						   },
						   {
							   "value": "086109",
							   "label": "其他住宿业"
						   }
					   ]
				   },
				   {
					   "value": "086200",
					   "label": "餐饮业",
					   "children": [
						   {
							   "value": "086201",
							   "label": "正餐服务"
						   },
						   {
							   "value": "086202",
							   "label": "快餐服务"
						   },
						   {
							   "value": "086203",
							   "label": "饮料及冷饮服务"
						   },
						   {
							   "value": "086209",
							   "label": "其他餐饮业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "090000",
			   "label": "信息传输、软件和信息技术服务业",
			   "children": [
				   {
					   "value": "096300",
					   "label": "电信、广播电视和卫星传输服务",
					   "children": [
						   {
							   "value": "096301",
							   "label": "电信"
						   },
						   {
							   "value": "096302",
							   "label": "广播电视传输服务"
						   },
						   {
							   "value": "096303",
							   "label": "卫星传输服务"
						   }
					   ]
				   },
				   {
					   "value": "096400",
					   "label": "互联网和相关服务",
					   "children": [
						   {
							   "value": "096401",
							   "label": "互联网接入及相关服务"
						   },
						   {
							   "value": "096402",
							   "label": "互联网信息服务"
						   },
						   {
							   "value": "096409",
							   "label": "其他互联网服务"
						   }
					   ]
				   },
				   {
					   "value": "096500",
					   "label": "软件和信息技术服务业",
					   "children": [
						   {
							   "value": "096501",
							   "label": "软件开发"
						   },
						   {
							   "value": "096502",
							   "label": "信息系统集成服务"
						   },
						   {
							   "value": "096503",
							   "label": "信息技术咨询服务"
						   },
						   {
							   "value": "096504",
							   "label": "数据处理和存储服务"
						   },
						   {
							   "value": "096505",
							   "label": "集成电路设计"
						   },
						   {
							   "value": "096509",
							   "label": "其他信息技术服务业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "100000",
			   "label": "金融业",
			   "children": [
				   {
					   "value": "106600",
					   "label": "货币金融服务",
					   "children": [
						   {
							   "value": "106601",
							   "label": "中央银行服务"
						   },
						   {
							   "value": "106602",
							   "label": "货币银行服务"
						   },
						   {
							   "value": "106603",
							   "label": "非货币银行服务"
						   },
						   {
							   "value": "106604",
							   "label": "银行监管服务"
						   }
					   ]
				   },
				   {
					   "value": "106700",
					   "label": "资本市场服务",
					   "children": [
						   {
							   "value": "106701",
							   "label": "证券市场服务"
						   },
						   {
							   "value": "106702",
							   "label": "期货市场服务"
						   },
						   {
							   "value": "106703",
							   "label": "证券期货监管服务"
						   },
						   {
							   "value": "106704",
							   "label": "资本投资服务"
						   },
						   {
							   "value": "106709",
							   "label": "其他资本市场服务"
						   }
					   ]
				   },
				   {
					   "value": "106800",
					   "label": "保险业",
					   "children": [
						   {
							   "value": "106801",
							   "label": "人身保险"
						   },
						   {
							   "value": "106802",
							   "label": "财产保险"
						   },
						   {
							   "value": "106803",
							   "label": "再保险"
						   },
						   {
							   "value": "106804",
							   "label": "养老金"
						   },
						   {
							   "value": "106805",
							   "label": "保险经纪与代理服务"
						   },
						   {
							   "value": "106806",
							   "label": "保险监管服务"
						   },
						   {
							   "value": "106809",
							   "label": "其他保险活动"
						   }
					   ]
				   },
				   {
					   "value": "106900",
					   "label": "其他金融业",
					   "children": [
						   {
							   "value": "106901",
							   "label": "金融信托与管理服务"
						   },
						   {
							   "value": "106902",
							   "label": "控股公司服务"
						   },
						   {
							   "value": "106903",
							   "label": "非金融机构支付服务"
						   },
						   {
							   "value": "106904",
							   "label": "金融信息服务"
						   },
						   {
							   "value": "106909",
							   "label": "其他未列明金融业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "110000",
			   "label": "房地产业",
			   "children": [
				   {
					   "value": "117000",
					   "label": "房地产业",
					   "children": [
						   {
							   "value": "117001",
							   "label": "房地产开发经营"
						   },
						   {
							   "value": "117002",
							   "label": "物业管理"
						   },
						   {
							   "value": "117003",
							   "label": "房地产中介服务"
						   },
						   {
							   "value": "117004",
							   "label": "自有房地产经营活动"
						   },
						   {
							   "value": "117009",
							   "label": "其他房地产业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "120000",
			   "label": "租赁和商务服务业",
			   "children": [
				   {
					   "value": "127100",
					   "label": "租赁业",
					   "children": [
						   {
							   "value": "127101",
							   "label": "机械设备租赁"
						   },
						   {
							   "value": "127102",
							   "label": "文化及日用品出租"
						   }
					   ]
				   },
				   {
					   "value": "127200",
					   "label": "商务服务业",
					   "children": [
						   {
							   "value": "127201",
							   "label": "企业管理服务"
						   },
						   {
							   "value": "127202",
							   "label": "法律服务"
						   },
						   {
							   "value": "127203",
							   "label": "咨询与调查"
						   },
						   {
							   "value": "127204",
							   "label": "广告业"
						   },
						   {
							   "value": "127205",
							   "label": "知识产权服务"
						   },
						   {
							   "value": "127206",
							   "label": "人力资源服务"
						   },
						   {
							   "value": "127207",
							   "label": "旅行社及相关服务"
						   },
						   {
							   "value": "127208",
							   "label": "安全保护服务"
						   },
						   {
							   "value": "127209",
							   "label": "其他商务服务业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "130000",
			   "label": "科学研究和技术服务业",
			   "children": [
				   {
					   "value": "137300",
					   "label": "研究和试验发展",
					   "children": [
						   {
							   "value": "137301",
							   "label": "自然科学研究和试验发展"
						   },
						   {
							   "value": "137302",
							   "label": "工程和技术研究和试验发展"
						   },
						   {
							   "value": "137303",
							   "label": "农业科学研究和试验发展"
						   },
						   {
							   "value": "137304",
							   "label": "医学研究和试验发展"
						   },
						   {
							   "value": "137305",
							   "label": "社会人文科学研究"
						   }
					   ]
				   },
				   {
					   "value": "137400",
					   "label": "专业技术服务业",
					   "children": [
						   {
							   "value": "137401",
							   "label": "气象服务"
						   },
						   {
							   "value": "137402",
							   "label": "地震服务"
						   },
						   {
							   "value": "137403",
							   "label": "海洋服务"
						   },
						   {
							   "value": "137404",
							   "label": "测绘服务"
						   },
						   {
							   "value": "137405",
							   "label": "质检技术服务"
						   },
						   {
							   "value": "137406",
							   "label": "环境与生态监测"
						   },
						   {
							   "value": "137407",
							   "label": "地质勘查"
						   },
						   {
							   "value": "137408",
							   "label": "工程技术"
						   },
						   {
							   "value": "137409",
							   "label": "其他专业技术服务业"
						   }
					   ]
				   },
				   {
					   "value": "137500",
					   "label": "科技推广和应用服务业",
					   "children": [
						   {
							   "value": "137501",
							   "label": "技术推广服务"
						   },
						   {
							   "value": "137502",
							   "label": "科技中介服务"
						   },
						   {
							   "value": "137509",
							   "label": "其他科技推广和应用服务业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "140000",
			   "label": "水利、环境和公共设施管理业",
			   "children": [
				   {
					   "value": "147600",
					   "label": "水利管理业",
					   "children": [
						   {
							   "value": "147601",
							   "label": "防洪除涝设施管理"
						   },
						   {
							   "value": "147602",
							   "label": "水资源管理"
						   },
						   {
							   "value": "147603",
							   "label": "天然水收集与分配"
						   },
						   {
							   "value": "147604",
							   "label": "水文服务"
						   },
						   {
							   "value": "147609",
							   "label": "其他水利管理业"
						   }
					   ]
				   },
				   {
					   "value": "147700",
					   "label": "生态保护和环境治理业",
					   "children": [
						   {
							   "value": "147701",
							   "label": "生态保护"
						   },
						   {
							   "value": "147702",
							   "label": "环境治理业"
						   }
					   ]
				   },
				   {
					   "value": "147800",
					   "label": "公共设施管理业",
					   "children": [
						   {
							   "value": "147801",
							   "label": "市政设施管理"
						   },
						   {
							   "value": "147802",
							   "label": "环境卫生管理"
						   },
						   {
							   "value": "147803",
							   "label": "城乡市容管理"
						   },
						   {
							   "value": "147804",
							   "label": "绿化管理"
						   },
						   {
							   "value": "147805",
							   "label": "公园和游览景区管理"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "150000",
			   "label": "居民服务、修理和其他服务业",
			   "children": [
				   {
					   "value": "157900",
					   "label": "居民服务业",
					   "children": [
						   {
							   "value": "157901",
							   "label": "家庭服务"
						   },
						   {
							   "value": "157902",
							   "label": "托儿所服务"
						   },
						   {
							   "value": "157903",
							   "label": "洗染服务"
						   },
						   {
							   "value": "157904",
							   "label": "理发及美容服务"
						   },
						   {
							   "value": "157905",
							   "label": "洗浴服务"
						   },
						   {
							   "value": "157906",
							   "label": "保健服务"
						   },
						   {
							   "value": "157907",
							   "label": "婚姻服务"
						   },
						   {
							   "value": "157908",
							   "label": "殡葬服务"
						   },
						   {
							   "value": "157909",
							   "label": "其他居民服务业"
						   }
					   ]
				   },
				   {
					   "value": "158000",
					   "label": "机动车、电子产品和日用产品修理业",
					   "children": [
						   {
							   "value": "158001",
							   "label": "汽车、摩托车修理与维护"
						   },
						   {
							   "value": "158002",
							   "label": "计算机和办公设备维修"
						   },
						   {
							   "value": "158003",
							   "label": "家用电器修理"
						   },
						   {
							   "value": "158009",
							   "label": "其他日用产品修理业"
						   }
					   ]
				   },
				   {
					   "value": "158100",
					   "label": "其他服务业",
					   "children": [
						   {
							   "value": "158101",
							   "label": "清洁服务"
						   },
						   {
							   "value": "158109",
							   "label": "其他未列明服务业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "160000",
			   "label": "教育",
			   "children": [
				   {
					   "value": "168200",
					   "label": "教育",
					   "children": [
						   {
							   "value": "168201",
							   "label": "学前教育"
						   },
						   {
							   "value": "168202",
							   "label": "初等教育"
						   },
						   {
							   "value": "168203",
							   "label": "中等教育"
						   },
						   {
							   "value": "168204",
							   "label": "高等教育"
						   },
						   {
							   "value": "168205",
							   "label": "特殊教育"
						   },
						   {
							   "value": "168209",
							   "label": "技能培训、教育辅助及其他教育"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "170000",
			   "label": "卫生和社会工作",
			   "children": [
				   {
					   "value": "178300",
					   "label": "卫生",
					   "children": [
						   {
							   "value": "178301",
							   "label": "医院"
						   },
						   {
							   "value": "178302",
							   "label": "社区医疗与卫生院"
						   },
						   {
							   "value": "178303",
							   "label": "门诊部（所）"
						   },
						   {
							   "value": "178304",
							   "label": "计划生育技术服务活动"
						   },
						   {
							   "value": "178305",
							   "label": "妇幼保健院（所、站）"
						   },
						   {
							   "value": "178306",
							   "label": "专科疾病防治院（所、站）"
						   },
						   {
							   "value": "178307",
							   "label": "疾病预防控制中心"
						   },
						   {
							   "value": "178309",
							   "label": "其他卫生活动"
						   }
					   ]
				   },
				   {
					   "value": "178400",
					   "label": "社会工作",
					   "children": [
						   {
							   "value": "178401",
							   "label": "提供住宿社会工作"
						   },
						   {
							   "value": "178402",
							   "label": "不提供住宿社会工作"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "180000",
			   "label": "文化、体育和娱乐业",
			   "children": [
				   {
					   "value": "188500",
					   "label": "新闻和出版业",
					   "children": [
						   {
							   "value": "188501",
							   "label": "新闻业"
						   },
						   {
							   "value": "188502",
							   "label": "出版业"
						   }
					   ]
				   },
				   {
					   "value": "188600",
					   "label": "广播、电视、电影和录音制作业",
					   "children": [
						   {
							   "value": "188601",
							   "label": "广播"
						   },
						   {
							   "value": "188602",
							   "label": "电视"
						   },
						   {
							   "value": "188603",
							   "label": "电影和影视节目制作"
						   },
						   {
							   "value": "188604",
							   "label": "电影和影视节目发行"
						   },
						   {
							   "value": "188605",
							   "label": "电影放映"
						   },
						   {
							   "value": "188606",
							   "label": "录音制作"
						   }
					   ]
				   },
				   {
					   "value": "188700",
					   "label": "文化艺术业",
					   "children": [
						   {
							   "value": "188701",
							   "label": "文艺创作与表演"
						   },
						   {
							   "value": "188702",
							   "label": "艺术表演场馆"
						   },
						   {
							   "value": "188703",
							   "label": "图书馆与档案馆"
						   },
						   {
							   "value": "188704",
							   "label": "文物及非物质文化遗产保护"
						   },
						   {
							   "value": "188705",
							   "label": "博物馆"
						   },
						   {
							   "value": "188706",
							   "label": "烈士陵园、纪念馆"
						   },
						   {
							   "value": "188707",
							   "label": "群众文化活动"
						   },
						   {
							   "value": "188709",
							   "label": "其他文化艺术业"
						   }
					   ]
				   },
				   {
					   "value": "188800",
					   "label": "体育",
					   "children": [
						   {
							   "value": "188801",
							   "label": "体育组织"
						   },
						   {
							   "value": "188802",
							   "label": "体育场馆"
						   },
						   {
							   "value": "188803",
							   "label": "休闲健身活动"
						   },
						   {
							   "value": "188809",
							   "label": "其他体育"
						   }
					   ]
				   },
				   {
					   "value": "188900",
					   "label": "娱乐业",
					   "children": [
						   {
							   "value": "188901",
							   "label": "室内娱乐活动"
						   },
						   {
							   "value": "188902",
							   "label": "游乐园"
						   },
						   {
							   "value": "188903",
							   "label": "彩票活动"
						   },
						   {
							   "value": "188904",
							   "label": "文化、娱乐、体育经纪代理"
						   },
						   {
							   "value": "188909",
							   "label": "其他娱乐业"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "190000",
			   "label": "公共管理、社会保障和社会组织",
			   "children": [
				   {
					   "value": "199000",
					   "label": "中国共产党机关",
					   "children": [
						   {
							   "value": "199001",
							   "label": "中国共产党机关"
						   }
					   ]
				   },
				   {
					   "value": "199100",
					   "label": "国家机构",
					   "children": [
						   {
							   "value": "199101",
							   "label": "国家权力机构"
						   },
						   {
							   "value": "199102",
							   "label": "国家行政机构"
						   },
						   {
							   "value": "199103",
							   "label": "人民法院和人民检察院"
						   },
						   {
							   "value": "199109",
							   "label": "其他国家机构"
						   }
					   ]
				   },
				   {
					   "value": "199200",
					   "label": "人民政协、民主党派",
					   "children": [
						   {
							   "value": "199201",
							   "label": "人民政协"
						   },
						   {
							   "value": "199202",
							   "label": "民主党派"
						   }
					   ]
				   },
				   {
					   "value": "199300",
					   "label": "社会保障",
					   "children": [
						   {
							   "value": "199301",
							   "label": "社会保障"
						   }
					   ]
				   },
				   {
					   "value": "199400",
					   "label": "群众团体、社会团体和其他成员组织",
					   "children": [
						   {
							   "value": "199401",
							   "label": "群众团体"
						   },
						   {
							   "value": "199402",
							   "label": "社会团体"
						   },
						   {
							   "value": "199403",
							   "label": "基金会"
						   },
						   {
							   "value": "199404",
							   "label": "宗教组织"
						   }
					   ]
				   },
				   {
					   "value": "199500",
					   "label": "基层群众自治组织",
					   "children": [
						   {
							   "value": "199501",
							   "label": "社区自治组织"
						   },
						   {
							   "value": "199502",
							   "label": "村民自治组织"
						   }
					   ]
				   }
			   ]
		   },
		   {
			   "value": "200000",
			   "label": "国际组织",
			   "children": [
				   {
					   "value": "209600",
					   "label": "国际组织",
					   "children": [
						   {
							   "value": "209601",
							   "label": "国际组织"
						   }
					   ]
				   }
			   ]
		   }*/
	]
}
setOptions()
</script>
